title=Carte pyramid\u00e9e
description=Calcule une carte pr\u00e9-rendue sous forme de pyramide. Le but est de fournir une carte tuil\u00e9e et multi-r\u00e9solution pour un affichage rapide via les service de publication OGC
input.mapcontext=Carte \u00e0 peindre dans la pyramide r\u00e9sultat. Si ce param\u00e8tre est pr\u00e9sent, il ne faut pas indiquer de jeu de donn\u00e9e (param\u00e8tre dataset).
input.dataset=jeu de donn\u00e9es \u00e0 utiliser comme carte \u00e0 tuiler. Chaque donn\u00e9e de la collection est rendue en utilisant le premier style qui lui est associ\u00e9e. Si aucun style n'est associ\u00e9 \u00e0 une donn\u00e9e, un style par d\u00e9faut est appliqu\u00e9. Si ce param\u00e8tre est d\u00e9fini, il faut pas sp\u00e9cifier de contexte cartographique (map-context).
input.crs=Le syst\u00e8me de coordonn\u00e9es dans lequel peindre la carte.
input.envelope=Zone d'int\u00e9r\u00eat \u00e0 pyramider. Cela permet de tuiler une sous-zone de la carte en entr\u00e9e. Si aucune enveloppe n'est d\u00e9finie, l'ensemble de la carte est tuil\u00e9e.
input.service=Service WMS sur lequel publier la carte pr\u00e9-rendue.
input.create-data=Si un nom est parametr\u00e9, une nouvelle est ajout\u00e9e au syst\u00e8me. Dans le cas o\u00f9 ce param\u00e8tre n'est pas utilis\u00e9, il faut soit sp\u00e9cifier un service de publication WMS, soit une donn\u00e9e pr\u00e9-existante \u00e0 mettre \u00e0 jour.
input.update-data=Si ce param\u00e8tre est donn\u00e9, le rendu sera ajout\u00e9 dans une pyramide d\u00e9j\u00e0 existante dans le syst\u00e8me.
input.tile-size=La taille du c\u00f4t\u00e9 (en pixel) des tuiles \u00e0 g\u00e9n\u00e9rer. Les tuiles sont carr\u00e9es.
input.tile-levels=Nombre de niveaux de d\u00e9tails \u00e0 g\u00e9n\u00e9rer. Si aucune indication n'est donn\u00e9e, le syst\u00e8me tentera de d\u00e9terminer le nombre de niveaux ad\u00e9quats en analysant la r\u00e9solution des donn\u00e9es en entr\u00e9e. Les niveaux de d\u00e9tails de la pyramide forment un quad-tree dont le premier niveau est une tuile unique couvrant l'ensemble de la carte en entr\u00e9e.
input.axes-convention=Direction des axes \u00e0 appliquer au syst\u00e8me de coordonn\u00e9es (param\u00e8tre crs) choisi. Par exemple, lorsque l'on sp\u00e9cifie un syst\u00e8me dont le premier axe est la latitude et le deuxi\u00e8me la longitude, il est possible d'inverser leur sens, et forcer la longitude en premier. Par d\u00e9faut, la longitude est forc\u00e9e en premier axe.
